OdDAI.Aggr.getAggregationTypeIfExist
\details
Returns internal aggreagtion type if it exists.
\returns valid pointer of aggregation type for aggreagate with complex(not POD) items, otherwise it returns nullptr

OdDAI.Aggr.hasValue(System.Int32,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Performs an attempt to find value within aggregation.
\param startIndex [in] index to start search
\param valueToFound [in] value to find
\returns Index of found item, or -1 if aggregation doesn't contain item with such value, starting from startIndex

OdDAI.Aggr.checkValuesUniqueness
\details
Checks aggregate for duplicate values.
\returns true if all values in aggregate are unique, otherwise it returns false